package com.shanchain.global;

/**
 * Created by zhoujian on 2017/5/16.
 * 存放网络请求的接口
 */

public interface HttpApi {

    String datas = "[{\"comments\":358,\"des\":\"今天很开心!\",\"images\":[\"0\"],\"likes\":137,\"name\":\"张建 0\",\"time\":\"0分钟前\",\"type\":1},\n" +
            "{\"comments\":234,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":307,\"name\":\"张建 1\",\"time\":\"1分钟前\",\"type\":1},\n" +
            "{\"comments\":331,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":754,\"name\":\"张建 2\",\"time\":\"2分钟前\",\"type\":1},\n" +
            "{\"comments\":117,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":79,\"name\":\"张建 3\",\"time\":\"3分钟前\",\"type\":1},\n" +
            "{\"comments\":172,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":621,\"name\":\"张建 4\",\"time\":\"4分钟前\",\"type\":1},\n" +
            "{\"comments\":130,\"des\":\"今天很开心!\",\"images\":[\"0\"],\"likes\":637,\"name\":\"张建 5\",\"time\":\"5分钟前\",\"type\":1},\n" +
            "{\"comments\":167,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\",\"3\"],\"likes\":654,\"name\":\"张建 6\",\"time\":\"6分钟前\",\"type\":1},\n" +
            "{\"comments\":369,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":225,\"name\":\"张建 7\",\"time\":\"7分钟前\",\"type\":1},\n" +
            "{\"comments\":220,\"des\":\"今天很开心!\",\"images\":[\"0\"],\"likes\":484,\"name\":\"张建 8\",\"time\":\"8分钟前\",\"type\":1},\n" +
            "{\"comments\":281,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":985,\"name\":\"张建 9\",\"time\":\"9分钟前\",\"type\":1},\n" +
            "{\"comments\":397,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":553,\"name\":\"张建 10\",\"time\":\"10分钟前\",\"type\":1},\n" +
            "{\"comments\":121,\"des\":\"今天很开心!\",\"images\":[],\"likes\":119,\"name\":\"张建 11\",\"time\":\"11分钟前\",\"type\":1},\n" +
            "{\"comments\":83,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":269,\"name\":\"张建 12\",\"time\":\"12分钟前\",\"type\":1},\n" +
            "{\"comments\":40,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\",\"3\"],\"likes\":875,\"name\":\"张建 13\",\"time\":\"13分钟前\",\"type\":1},\n" +
            "{\"comments\":168,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\"],\"likes\":402,\"name\":\"张建 14\",\"time\":\"14分钟前\",\"type\":1},\n" +
            "{\"comments\":239,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\",\"3\"],\"likes\":187,\"name\":\"张建 15\",\"time\":\"15分钟前\",\"type\":1},\n" +
            "{\"comments\":286,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":700,\"name\":\"张建 16\",\"time\":\"16分钟前\",\"type\":1},\n" +
            "{\"comments\":224,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":849,\"name\":\"张建 17\",\"time\":\"17分钟前\",\"type\":1},\n" +
            "{\"comments\":334,\"des\":\"今天很开心!\",\"images\":[\"0\"],\"likes\":53,\"name\":\"张建 18\",\"time\":\"18分钟前\",\"type\":1},\n" +
            "{\"comments\":278,\"des\":\"今天很开心!\",\"images\":[\"0\",\"1\",\"2\"],\"likes\":818,\"name\":\"张建 19\",\"time\":\"19分钟前\",\"type\":1},\n" +
            "{\"activeDes\":\"活动描述信息0\",\"comments\":192,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"0icon.png\",\"likes\":705,\"name\":\"石家海0\",\"otherDes\":\"今天有03人也在愉快的玩耍\",\"stroyImgUrl\":\"0.png\",\"time\":\"20分钟前\",\"title\":\"故事标题0\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息1\",\"comments\":398,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"1icon.png\",\"likes\":509,\"name\":\"石家海1\",\"otherDes\":\"今天有23人也在愉快的玩耍\",\"stroyImgUrl\":\"1.png\",\"time\":\"21分钟前\",\"title\":\"故事标题1\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息2\",\"comments\":282,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"2icon.png\",\"likes\":368,\"name\":\"石家海2\",\"otherDes\":\"今天有43人也在愉快的玩耍\",\"stroyImgUrl\":\"2.png\",\"time\":\"22分钟前\",\"title\":\"故事标题2\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息3\",\"comments\":349,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"3icon.png\",\"likes\":701,\"name\":\"石家海3\",\"otherDes\":\"今天有63人也在愉快的玩耍\",\"stroyImgUrl\":\"\",\"time\":\"23分钟前\",\"title\":\"故事标题3\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息4\",\"comments\":293,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"4icon.png\",\"likes\":256,\"name\":\"石家海4\",\"otherDes\":\"今天有83人也在愉快的玩耍\",\"stroyImgUrl\":\"4.png\",\"time\":\"24分钟前\",\"title\":\"故事标题4\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息5\",\"comments\":142,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"5icon.png\",\"likes\":576,\"name\":\"石家海5\",\"otherDes\":\"今天有103人也在愉快的玩耍\",\"stroyImgUrl\":\"5.png\",\"time\":\"25分钟前\",\"title\":\"故事标题5\",\"type\":3},\n" +
            "{\"activeDes\":\"活动描述信息6\",\"comments\":288,\"des\":\"哈哈哈哈哈!\",\"iconUrl\":\"6icon.png\",\"like \",\"challegeTime\":\"5月0日\",\"comments\":185,\"des\":\"#善数者正式发布#0我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"0.png\",\"likes\":24,\"name\":\"李江宇0\",\"otherDes\":\"一起来试试吧\",\"time\":\"30分钟前\",\"title\":\"寻找神秘点\",\"type\":2},\n" +
            "{\"activeDes\":\"假期放松一下,率先找到神秘地点打卡者获胜。\",\"addr\":\"深圳市\",\"challegeTime\":\"5月1日\",\"comments\":209,\"des\":\"#善数者正式发布#1我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"1.png\",\"likes\":742,\"name\":\"李江宇1\",\"otherDes\":\"一起来试试吧\",\"time\":\"31分钟前\",\"title\":\"寻找神秘点\",\"type\":2},\n" +
            "{\"activeDes\":\"假期放松一下,率先找到神秘地点打卡者获胜。\",\"addr\":\"深圳市\",\"challegeTime\":\"5月2日\",\"comments\":363,\"des\":\"#善数者正式发布#2我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"2.png\",\"likes\":671,\"name\":\"李江宇2\",\"otherDes\":\"一起来试试吧\",\"time\":\"32分钟前\",\"title\":\"寻找神秘点\",\"type\":2},\n" +
            "{\"activeDes\":\"假期放松一下,率先找到神秘地点打卡者获胜。\",\"addr\":\"深圳市\",\"challegeTime\":\"5月3日\",\"comments\":80,\"des\":\"#善数者正式发布#3我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"3.png\",\"likes\":606,\"name\":\"李江宇3\",\"otherDes\":\"一起来试试吧\",\"time\":\"33分钟前\",\"title\":\"寻找神秘点\",\"type\":2},\n" +
            "{\"activeDes\":\"假期放松一下,率先找到神秘地点打卡者获胜。\",\"addr\":\"深圳市\",\"challegeTime\":\"5月4日\",\"comments\":55,\"des\":\"#善数者正式发布#4我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"4.png\",\"likes\":563,\"name\":\"李江宇4\",\"otherDes\":\"一起来试试吧\",\"time\":\"34分钟前\",\"title\":\"寻找神秘点\",\"type\":2},\n" +
            "{\"activeDes\":\"假期放松一下,率先找到神秘地点打卡者获胜。\",\"addr\":\"深圳市\",\"challegeTime\":\"5月5日\",\"comments\":319,\"des\":\"#善数者正式发布#5我自定义了一个挑战任务,要不要和我一起来?\",\"iconUrl\":\"5.png\",\"likes\":788,\"name\":\"李江宇5\",\"otherDes\":\"一起来试试吧\",\"time\":\"35分钟前\",\"title\":\"寻找神秘点\",\"type\":2}]";

}
